Picatout/stm8_nucleo/inc/stm8s208.h
#ifndef STM8S208_H
#define STM8S208_H

#include <stdint.h>

// bit mask
#define B0_MASK (1<<0)
#define B1_MASK (1<<1)
#define B2_MASK (1<<2)
#define B3_MASK (1<<3)
#define B4_MASK (1<<4)
#define B5_MASK (1<<5)
#define B6_MASK (1<<6)
#define B7_MASK (1<<7)

/* HSI oscillator frequency 16 Mhz */
#define Fmaster 16000000UL
/* LSI oscillator frequency 128 Khz */
#define FLSI 128000 

// special fonction register type
#define sfr (volatile uint8_t*)
// pointer
#define sfrp *sfr

// controller memory regions
// C4/C6,S4/S6 and K4/K6 all have 2K RAM and 1K EEPROM
#define RAM_SIZE (6144) 
#define EEPROM_SIZE (2048)
// STM8S208RB have 128K flash
#define FLASH_SIZE (0x20000)

#define RAM_BASE (0)
#define RAM_END (RAM_BASE+RAM_SIZE-1)
#define EEPROM_BASE (0x4000)
#define EEPROM_END (EEPROM_BASE+EEPROM_SIZE-1)
#define SFR_BASE (0x5000)
#define SFR_END (0x57FF)
#define FLASH_BASE (0x8000)
#define OPTION_BASE (0x4800)
#define OPTION_END (0x487F)
#define DEVID_BASE (0x48CD)
#define DEVID_END (0x48D8)
#define DEVID_BASE (0x48CD)
#define DEVID_END (0x48D8)
#define DEBUG_BASE (0X7F00)
#define DEBUG_END (0X7FFF)

// options bytes
// this one can be programmed only from SWIM (ICP)
#define OPT0 sfrp(0x4800)
// these can be programmed at runtime (IAP)
#define OPT1 sfrp(0x4801)
#define NOPT1 sfrp(0x4802)
#define OPT2 sfrp(0x4803)
#define NOPT2 sfrp(0x4804)
#define OPT3 sfrp(0x4805)
#define NOPT3 sfrp(0x4806)
#define OPT4 sfrp(0x4807)
#define NOPT4 sfrp(0x4808)
#define OPT5 sfrp(0x4809)
#define NOPT5 sfrp(0x480A)
#define OPT6 sfrp(0x480B)
#define OPTBL sfrp(0x487E)
#define NOPTBL sfrp(0x487F)
// option registers usage
// read out protection, value 0xAA enable ROP
#define ROP OPT0  
// user boot code, {0..0x3e} 512 bytes row
#define UBC OPT1
#define NUBC NOPT1
// alternate function register
#define AFR OPT2
#define NAFR NOPT2
// miscelinous options
#define MISCOPT OPT3
#define NMISCOPT NOPT3
// clock options
#define CLKOPT OPT4
#define NCLKOPT NOPT4
// HSE clock startup delay
#define HSECNT OPT5
#define NHSECNT NOPT5

// MISCOPT bits
//#define  MISCOPT_HSITRIM   B4_MASK
#define  MISCOPT_LSIEN     B3_MASK
#define  MISCOPT_IWDG_HW   B2_MASK
#define  MISCOPT_WWDG_HW   B1_MASK
#define  MISCOPT_WWDG_HALT B0_MASK
// NMISCOPT bits
#define  NMISCOPT_NHSITRIM   ~B4_MASK
#define  NMISCOPT_NLSIEN     ~B3_MASK
#define  NMISCOPT_NIWDG_HW   ~B2_MASK
#define  NMISCOPT_NWWDG_HW   ~B1_MASK
#define  NMISCOPT_NWWDG_HALT ~B0_MASK
// CLKOPT bits
#define CLKOPT_EXT_CLK  B3_MASK
#define CLKOPT_CKAWUSEL B2_MASK
#define CLKOPT_PRS_C1   B1_MASK
#define CLKOPT_PRS_C0   B0_MASK
// NCLKOPT bits
#define NCLKOPT_NEXT_CLK  ~B3_MASK
#define NCLKOPT_NCKAWUSEL ~B2_MASK
#define NCLKOPT_NPRS_C1   ~B1_MASK
#define NCLKOPT_NPRS_C0   ~B0_MASK

// AFR option, remapable functions
#define AFR7_BEEP    B7_MASK
#define AFR6_I2C     B6_MASK
#define AFR5_TIM1    B5_MASK
#define AFR4_TIM1  	 B4_MASK
#define AFR3_TIM1    B3_MASK
#define AFR2_CCO     B2_MASK
#define AFR1_TIM2    B1_MASK
#define AFR0_ADC     B0_MASK
// NAFR option, remapable functions
#define NAFR7_NBEEP    ~B7_MASK
#define NAFR6_NI2C     ~B6_MASK
#define NAFR5_NTIM1    ~B5_MASK
#define NAFR4_NTIM1    ~B4_MASK
#define NAFR3_NTIM1    ~B3_MASK
#define NAFR2_NCCO     ~B2_MASK
#define NAFR1_NTIM2    ~B1_MASK
#define NAFR0_NADC     ~B0_MASK
 

//device ID (read only)
#define DEVID_XL sfrp(0x48CD)
#define DEVID_XH sfrp(0x48CE)
#define DEVID_YL sfrp(0x48CF)
#define DEVID_YH sfrp(0x48D0)
#define DEVID_WAF sfrp(0x48D1)
#define DEVID_LOT0 sfrp(0x48D2)
#define DEVID_LOT1 sfrp(0x48D3)
#define DEVID_LOT2 sfrp(0x48D4)
#define DEVID_LOT3 sfrp(0x48D5)
#define DEVID_LOT4 sfrp(0x48D6)
#define DEVID_LOT5 sfrp(0x48D7)
#define DEVID_LOT6 sfrp(0x48D8)


typedef struct{
	uint8_t odr;
	uint8_t idr;
	uint8_t ddr;
	uint8_t cr1;
	uint8_t cr2; 
}gpio_t;

// GPIO ports array
#define PORT_COUNT  (9)
#define PA 0
#define PB 1
#define PC 2
#define PD 3
#define PE 4
#define PF 5
#define PG 6
#define PH 7 
#define PI 8 

// port bit mask
#define PIN0 (1<<0)
#define PIN1 (1<<1)
#define PIN2 (1<<2)
#define PIN3 (1<<3)
#define PIN4 (1<<4)
#define PIN5 (1<<5)
#define PIN6 (1<<6)
#define PIN7 (1<<7)

#define GPIO 0x5000

/* GPIO */
#define PA_ODR sfrp(0x5000)
#define PA_IDR sfrp(0x5001)
#define PA_DDR sfrp(0x5002)
#define PA_CR1 sfrp(0x5003)
#define PA_CR2 sfrp(0x5004)

#define PB_ODR sfrp(0x5005)
#define PB_IDR sfrp(0x5006)
#define PB_DDR sfrp(0x5007)
#define PB_CR1 sfrp(0x5008)
#define PB_CR2 sfrp(0x5009)

#define PC_ODR sfrp(0x500A)
#define PC_IDR sfrp(0x500B)
#define PC_DDR sfrp(0x500C)
#define PC_CR1 sfrp(0x500D)
#define PC_CR2 sfrp(0x500E)

#define PD_ODR sfrp(0x500F)
#define PD_IDR sfrp(0x5010)
#define PD_DDR sfrp(0x5011)
#define PD_CR1 sfrp(0x5012)
#define PD_CR2 sfrp(0x5013)

#define PE_ODR sfrp(0x5014)
#define PE_IDR sfrp(0x5015)
#define PE_DDR sfrp(0x5016)
#define PE_CR1 sfrp(0x5017)
#define PE_CR2 sfrp(0x5018)

#define PF_ODR sfrp(0x5019)
#define PF_IDR sfrp(0x501A)
#define PF_DDR sfrp(0x501B)
#define PF_CR1 sfrp(0x501C)
#define PF_CR2 sfrp(0x501D)

#define PG_ODR sfrp(0x501E)
#define PG_IDR sfrp(0x501F)
#define PG_DDR sfrp(0x5020)
#define PG_CR1 sfrp(0x5021)
#define PG_CR2 sfrp(0x5022)

/* port H not present on LQFP48/LQFP64 package */
#define PH_BASE sfrp(0X5023)
#define PH_ODR  sfrp(0x5023)
#define PH_IDR  sfrp(0x5024)
#define PH_DDR  sfrp(0x5025)
#define PH_CR1  sfrp(0x5026)
#define PH_CR2  sfrp(0x5027)

/* port I ; only bit 0 on LQFP64 package, not present on LQFP48 */
#define PI_BASE sfrp(0X5028)
#define PI_ODR  sfrp(0x5028)
#define PI_IDR  sfrp(0x5029)
#define PI_DDR  sfrp(0x502a)
#define PI_CR1  sfrp(0x502b)
#define PI_CR2  sfrp(0x502c)

//input modes CR1
#define INPUT_FLOAT (0)
#define INPUT_PULLUP (1)
//output mode CR1
#define OUTPUT_OD (0)
#define OUTPUT_PP (1)
//input modes CR2
#define INPUT_DI (0)
#define INPUT_EI (1)
//output speed CR2
#define OUTPUT_SLOW (0)
#define OUTPUT_FAST (1)
// combined bits for configuration
//input, bit 0 -> input type, bit 1 -> interrupt
#define INPUT_FLOAT_DI (0)
#define INPUT_FLOAT_EI (2)
#define INPUT_PU_DI (1)
#define INPUT_PU_EI (3)
//output, bit 0 -> type, bit 1 -> speed
#define OUTPUT_OD_SLOW (0+4)
#define OUTPUT_OD_FAST (2+4)
#define OUTPUT_PP_SLOW (1+4)
#define OUTPUT_PP_FAST (3+4)


/* Flash */
#define FLASH_CR1 sfrp(0x505A)
#define FLASH_CR2 sfrp(0x505B)
#define FLASH_NCR2 sfrp(0x505C)
#define FLASH_FPR sfrp(0x505D)
#define FLASH_NFPR sfrp(0x505E)
#define FLASH_IAPSR sfrp(0x505F)
#define FLASH_PUKR sfrp(0x5062)
#define FLASH_DUKR sfrp(0x5064)
// data memory unlock keys
#define FLASH_DUKR_KEY1 (0xae)
#define FLASH_DUKR_KEY2 (0x56)
// flash memory unlock keys
#define FLASH_PUKR_KEY1 (0x56)
#define FLASH_PUKR_KEY2 (0xae)
// FLASH_CR1 bits
#define FLASH_CR1_HALT B3_MASK
#define FLASH_CR1_AHALT B2_MASK
#define FLASH_CR1_IE B1_MASK
#define FLASH_CR1_FIX B0_MASK
// FLASH_CR2 bits
#define FLASH_CR2_OPT B7_MASK
#define FLASH_CR2_WPRG B6_MASK
#define FLASH_CR2_ERASE B5_MASK
#define FLASH_CR2_FPRG B4_MASK
#define FLASH_CR2_PRG B0_MASK
// FLASH_NCR2 bits
#define FLASH_NCR2_NOPT ~B7_MASK
#define FLASH_NCR2_NWPRG ~B6_MASK
#define FLASH_NCR2_NERASE ~B5_MASK
#define FLASH_NCR2_NFPRG ~B4_MASK
#define FLASH_NCR2_NPRG ~B0_MASK
// FLASH_FPR bits
#define FLASH_FPR_WPB5 B5_MASK
#define FLASH_FPR_WPB4 B4_MASK
#define FLASH_FPR_WPB3 B3_MASK
#define FLASH_FPR_WPB2 B2_MASK
#define FLASH_FPR_WPB1 B1_MASK
#define FLASH_FPR_WPB0 B0_MASK
// FLASH_NFPR bits
#define FLASH_NFPR_NWPB5 B5_MASK
#define FLASH_NFPR_NWPB4 B4_MASK
#define FLASH_NFPR_NWPB3 B3_MASK
#define FLASH_NFPR_NWPB2 B2_MASK
#define FLASH_NFPR_NWPB1 B1_MASK
#define FLASH_NFPR_NWPB0 B0_MASK
// FLASH_IAPSR bits
#define FLASH_IAPSR_HVOFF B6_MASK
#define FLASH_IAPSR_DUL B3_MASK
#define FLASH_IAPSR_EOP B2_MASK
#define FLASH_IAPSR_PUL B1_MASK
#define FLASH_IAPSR_WR_PG_DIS B0_MASK

/* Interrupt control */
#define EXTI_CR1 sfrp(0x50A0)
#define EXTI_CR2 sfrp(0x50A1)

