Picatout/stm8_nucleo/inc/stm8s208.h
/* Reset Status */
#define RST_SR sfrp(0x50B3)

/* Clock Registers */
#define CLK_ICKR sfrp(0x50c0)
#define CLK_ECKR sfrp(0x50c1)
#define CLK_CMSR sfrp(0x50C3)
#define CLK_SWR sfrp(0x50C4)
#define CLK_SWCR sfrp(0x50C5)
#define CLK_CKDIVR sfrp(0x50C6)
#define CLK_PCKENR1 sfrp(0x50C7)
#define CLK_CSSR sfrp(0x50C8)
#define CLK_CCOR sfrp(0x50C9)
#define CLK_PCKENR2 sfrp(0x50CA)
#define CLK_HSITRIMR sfrp(0x50CC)
#define CLK_SWIMCCR sfrp(0x50CD)

// Peripherals clock gating
// CLK_PCKENR1 
#define CLK_PCKENR1_TIM1 (1<<7)
#define CLK_PCKENR1_TIM3 (1<<6)
#define CLK_PCKENR1_TIM2 (1<<5)
#define CLK_PCKENR1_TIM4 (1<<4)
#define CLK_PCKENR1_UART3 (1<<3)
#define CLK_PCKENR1_UART1 (1<<2)
#define CLK_PCKENR1_SPI (1<<1)
#define CLK_PCKENR1_I2C (1<<0)
//CLK_PCKENR2
#define CLK_PCKENR2_ADC (1<<3)
#define CLK_PCKENR2_AWU (1<<2)

/* Clock bitmasks */
#define CLK_ICKR_REGAH (1 << 5)
#define CLK_ICKR_LSIRDY (1 << 4)
#define CLK_ICKR_LSIEN (1 << 3)
#define CLK_ICKR_FHW (1 << 2)
#define CLK_ICKR_HSIRDY (1 << 1)
#define CLK_ICKR_HSIEN (1 << 0)

#define CLK_ECKR_HSERDY (1 << 1)
#define CLK_ECKR_HSEEN (1 << 0)
// clock source
#define CLK_SWR_HSI 0xE1
#define CLK_SWR_LSI 0xD2
#define CLK_SWR_HSE 0xB4

#define CLK_SWCR_SWIF (1 << 3)
#define CLK_SWCR_SWIEN (1 << 2)
#define CLK_SWCR_SWEN (1 << 1)
#define CLK_SWCR_SWBSY (1 << 0)

#define CLK_CKDIVR_HSIDIV1 (1 << 4)
#define CLK_CKDIVR_HSIDIV0 (1 << 3)
#define CLK_CKDIVR_CPUDIV2 (1 << 2)
#define CLK_CKDIVR_CPUDIV1 (1 << 1)
#define CLK_CKDIVR_CPUDIV0 (1 << 0)

/* Watchdog */
#define WWDG_CR sfrp(0x50D1)
#define WWDG_WR sfrp(0x50D2)
#define IWDG_KR sfrp(0x50E0)
#define IWDG_PR sfrp(0x50E1)
#define IWDG_RLR sfrp(0x50E2)
#define AWU_CSR1 sfrp(0x50F0)
#define AWU_APR sfrp(0x50F1)
#define AWU_TBR sfrp(0x50F2)

/* Beep */
/* beeper output is alternate function AFR7 on PD4 */
/* connected to CN9-6 */
#define BEEP_CSR sfrp(0x50F3)
#define BEEP_PORT PD 
#define BEEP_BIT 4 
#define BEEP_MASK (1<<BEEP_BIT)

/* SPI */
#define SPI_CR1 sfrp(0x5200)
#define SPI_CR2 sfrp(0x5201)
#define SPI_ICR sfrp(0x5202)
#define SPI_SR sfrp(0x5203)
#define SPI_DR sfrp(0x5204)
#define SPI_CRCPR sfrp(0x5205)
#define SPI_RXCRCR sfrp(0x5206)
#define SPI_TXCRCR sfrp(0x5207)

/* I2C */
#define I2C_CR1 sfrp(0x5210)
#define I2C_CR2 sfrp(0x5211)
#define I2C_FREQR sfrp(0x5212)
#define I2C_OARL sfrp(0x5213)
#define I2C_OARH sfrp(0x5214)
#define I2C_DR sfrp(0x5216)
#define I2C_SR1 sfrp(0x5217)
#define I2C_SR2 sfrp(0x5218)
#define I2C_SR3 sfrp(0x5219)
#define I2C_ITR sfrp(0x521A)
#define I2C_CCRL sfrp(0x521B)
#define I2C_CCRH sfrp(0x521C)
#define I2C_TRISER sfrp(0x521D)
#define I2C_PECR sfrp(0x521E)

#define I2C_CR1_NOSTRETCH (1 << 7)
#define I2C_CR1_ENGC (1 << 6)
#define I2C_CR1_PE (1 << 0)

#define I2C_CR2_SWRST (1 << 7)
#define I2C_CR2_POS (1 << 3)
#define I2C_CR2_ACK (1 << 2)
#define I2C_CR2_STOP (1 << 1)
#define I2C_CR2_START (1 << 0)

#define I2C_OARL_ADD0 (1 << 0)

#define I2C_OAR_ADDR_7BIT ((I2C_OARL & 0xFE) >> 1)
#define I2C_OAR_ADDR_10BIT (((I2C_OARH & 0x06) << 9) | (I2C_OARL & 0xFF))

#define I2C_OARH_ADDMODE (1 << 7)
#define I2C_OARH_ADDCONF (1 << 6)
#define I2C_OARH_ADD9 (1 << 2)
#define I2C_OARH_ADD8 (1 << 1)

#define I2C_SR1_TXE (1 << 7)
#define I2C_SR1_RXNE (1 << 6)
#define I2C_SR1_STOPF (1 << 4)
#define I2C_SR1_ADD10 (1 << 3)
#define I2C_SR1_BTF (1 << 2)
#define I2C_SR1_ADDR (1 << 1)
#define I2C_SR1_SB (1 << 0)

#define I2C_SR2_WUFH (1 << 5)
#define I2C_SR2_OVR (1 << 3)
#define I2C_SR2_AF (1 << 2)
#define I2C_SR2_ARLO (1 << 1)
#define I2C_SR2_BERR (1 << 0)

#define I2C_SR3_DUALF (1 << 7)
#define I2C_SR3_GENCALL (1 << 4)
#define I2C_SR3_TRA (1 << 2)
#define I2C_SR3_BUSY (1 << 1)
#define I2C_SR3_MSL (1 << 0)

#define I2C_ITR_ITBUFEN (1 << 2)
#define I2C_ITR_ITEVTEN (1 << 1)
#define I2C_ITR_ITERREN (1 << 0)

/* Precalculated values, all in KHz */
#define I2C_CCRH_16MHZ_FAST_400 0x80
#define I2C_CCRL_16MHZ_FAST_400 0x0D
/*
 * Fast I2C mode max rise time = 300ns
 * I2C_FREQR = 16 (MHz) => tMASTER = 1/16 = 62.5 ns
 * TRISER = (300/62.5) + 1 = floor(4.8) + 1 = 5.
 */
#define I2C_TRISER_16MHZ_FAST_400 0x05;

#define I2C_CCRH_16MHZ_FAST_320 0xC0
#define I2C_CCRL_16MHZ_FAST_320 0x02
#define I2C_TRISER_16MHZ_FAST_320 0x05;

#define I2C_CCRH_16MHZ_FAST_200 0x80
#define I2C_CCRL_16MHZ_FAST_200 0x1A
#define I2C_TRISER_16MHZ_FAST_200 0x05;

#define I2C_CCRH_16MHZ_STD_100 0x00
#define I2C_CCRL_16MHZ_STD_100 0x50
/*
 * Standard I2C mode max rise time = 1000ns
 * I2C_FREQR = 16 (MHz) => tMASTER = 1/16 = 62.5 ns
 * TRISER = (1000/62.5) + 1 = floor(16) + 1 = 17.
 */
#define I2C_TRISER_16MHZ_STD_100 0x11;

#define I2C_CCRH_16MHZ_STD_50 0x00
#define I2C_CCRL_16MHZ_STD_50 0xA0
#define I2C_TRISER_16MHZ_STD_50 0x11;

#define I2C_CCRH_16MHZ_STD_20 0x01
#define I2C_CCRL_16MHZ_STD_20 0x90
#define I2C_TRISER_16MHZ_STD_20 0x11;

#define I2C_READ 1
#define I2C_WRITE 0

/* baudrate constant for brr_value table access */
typedef enum baudrate {
BR2400,
BR4800,
BR9600,
BR19200,
BR38400,
BR57600,
BR115200,
BR230400,
BR460800,
BR921600,
}baud_t;

/* UART registers offset from */
/* base address */
#define UART_SR 0
#define UART_DR 1
#define UART_BRR1 2
#define UART_BRR2 3
#define UART_CR1 4
#define UART_CR2 5
#define UART_CR3 6
#define UART_CR4 7
#define UART_CR5 8
#define UART_CR6 9
#define UART_GTR 9
#define UART_PSCR 10

/* uart identifier */
/* to be used by uart_init */
#define UART1 (0)
#define UART3 (1)

/* pins used by uart */
#define UART1_TX_PIN B5_MASK
#define UART1_RX_PIN B4_MASK
#define UART3_TX_PIN B5_MASK
#define UART3_RX_PIN B6_MASK
/* uart port base address */
#define UART1_PORT PA 
#define UART3_PORT PD

/* UART1 */
#define UART1_BASE  sfrp(0x5230)
#define UART1_SR    sfrp(0x5230)
#define UART1_DR    sfrp(0x5231)
#define UART1_BRR1  sfrp(0x5232)
#define UART1_BRR2  sfrp(0x5233)
#define UART1_CR1   sfrp(0x5234)
#define UART1_CR2   sfrp(0x5235)
#define UART1_CR3   sfrp(0x5236)
#define UART1_CR4   sfrp(0x5237)
#define UART1_CR5   sfrp(0x5238)
#define UART1_GTR   sfrp(0x5239)
#define UART1_PSCR  sfrp(0x523A)

/* UART3 */
#define UART3_SR   sfrp(0x5240)
#define UART3_DR   sfrp(0x5241)
#define UART3_BRR1 sfrp(0x5242)
#define UART3_BRR2 sfrp(0x5243)
#define UART3_CR1  sfrp(0x5244)
#define UART3_CR2  sfrp(0x5245)
#define UART3_CR3  sfrp(0x5246)
#define UART3_CR4  sfrp(0x5247)
#define UART3_CR6  sfrp(0x4249)


/* UART Status Register bits */
#define UART_SR_TXE (1 << 7)
#define UART_SR_TC (1 << 6)
#define UART_SR_RXNE (1 << 5)
#define UART_SR_IDLE (1 << 4)
#define UART_SR_OR (1 << 3)
#define UART_SR_NF (1 << 2)
#define UART_SR_FE (1 << 1)
#define UART_SR_PE (1 << 0)

