Picatout/stm8_nucleo/inc/stm8s208.h
/* Capture/Compare Mode Register 3 - channel configured in input */
#define TIM1_CCMR3_IC3F3 (1 << 7)
#define TIM1_CCMR3_IC3F2 (1 << 6)
#define TIM1_CCMR3_IC3F1 (1 << 5)
#define TIM1_CCMR3_IC3F0 (1 << 4)
#define TIM1_CCMR3_IC3PSC1 (1 << 3)
#define TIM1_CCMR3_IC3PSC0 (1 << 2)
/* #define TIM1_CCMR3_CC3S1 (1 << 1) */
#define TIM1_CCMR3_CC3S0 (1 << 0)

/* Capture/Compare Mode Register 4 - channel configured in output */
#define TIM1_CCMR4_OC4CE (1 << 7)
#define TIM1_CCMR4_OC4M2 (1 << 6)
#define TIM1_CCMR4_OC4M1 (1 << 5)
#define TIM1_CCMR4_OC4M0 (1 << 4)
#define TIM1_CCMR4_OC4PE (1 << 3)
#define TIM1_CCMR4_OC4FE (1 << 2)
#define TIM1_CCMR4_CC4S1 (1 << 1)
#define TIM1_CCMR4_CC4S0 (1 << 0)

/* Capture/Compare Mode Register 4 - channel configured in input */
#define TIM1_CCMR4_IC4F3 (1 << 7)
#define TIM1_CCMR4_IC4F2 (1 << 6)
#define TIM1_CCMR4_IC4F1 (1 << 5)
#define TIM1_CCMR4_IC4F0 (1 << 4)
#define TIM1_CCMR4_IC4PSC1 (1 << 3)
#define TIM1_CCMR4_IC4PSC0 (1 << 2)
/* #define TIM1_CCMR4_CC4S1 (1 << 1) */
#define TIM1_CCMR4_CC4S0 (1 << 0)

/* Timer 2 - 16-bit timer */
#define TIM2_CR1 sfrp(0x5300)
#define TIM2_IER sfrp(0x5301)
#define TIM2_SR1 sfrp(0x5302)
#define TIM2_SR2 sfrp(0x5303)
#define TIM2_EGR sfrp(0x5304)
#define TIM2_CCMR1 sfrp(0x5305)
#define TIM2_CCMR2 sfrp(0x5306)
#define TIM2_CCMR3 sfrp(0x5307)
#define TIM2_CCER1 sfrp(0x5308)
#define TIM2_CCER2 sfrp(0x5309)
#define TIM2_CNTRH sfrp(0x530A)
#define TIM2_CNTRL sfrp(0x530B)
#define TIM2_PSCR sfrp(0x530C)
#define TIM2_ARRH sfrp(0x530D)
#define TIM2_ARRL sfrp(0x530E)
#define TIM2_CCR1H sfrp(0x530F)
#define TIM2_CCR1L sfrp(0x5310)
#define TIM2_CCR2H sfrp(0x5311)
#define TIM2_CCR2L sfrp(0x5312)
#define TIM2_CCR3H sfrp(0x5313)
#define TIM2_CCR3L sfrp(0x5314)

/* Timer 3 */
#define TIM3_CR1 sfrp(0x5320)
#define TIM3_IER sfrp(0x5321)
#define TIM3_SR1 sfrp(0x5322)
#define TIM3_SR2 sfrp(0x5323)
#define TIM3_EGR sfrp(0x5324)
#define TIM3_CCMR1 sfrp(0x5325)
#define TIM3_CCMR2 sfrp(0x5326)
#define TIM3_CCER1 sfrp(0x5327)
#define TIM3_CNTRH sfrp(0x5328)
#define TIM3_CNTRL sfrp(0x5329)
#define TIM3_PSCR sfrp(0x532A)
#define TIM3_ARRH sfrp(0x532B)
#define TIM3_ARRL sfrp(0x532C)
#define TIM3_CCR1H sfrp(0x532D)
#define TIM3_CCR1L sfrp(0x532E)
#define TIM3_CCR2H sfrp(0x532F)
#define TIM3_CCR2L sfrp(0x5330)

// TIM3_CR1  fields
#define TIM3_CR1_CEN (1<<0)
#define TIM3_CR1_UDIS (1<<1)
#define TIM3_CR1_URS (1<<2)
#define TIM3_CR1_OPM (1<<3)
#define TIM3_CR1_ARPE (1<<7)
//TIM3_CCR2  fields
#define TIM3_CCMR2_CC2S_POS (0)
#define TIM3_CCMR2_OC2PE_POS (3)
#define TIM3_CCMR2_OC2M_POS (4)  
//TIM3_CCER1 fields
#define TIM3_CCER1_CC1E (1<<0)
#define TIM3_CCER1_CC1P (1<<1)
#define TIM3_CCER1_CC2E (1<<4)
#define TIM3_CCER1_CC2P (1<<5)
//TIM3_CCER2 fields
#define TIM3_CCER2_CC3E (1<<0)
#define TIM3_CCER2_CC3P (1<<1)

/* Timer 4 */
#define TIM4_CR1 sfrp(0x5340)
#define TIM4_IER sfrp(0x5341)
#define TIM4_SR sfrp(0x5342)
#define TIM4_EGR sfrp(0x5343)
#define TIM4_CNTR sfrp(0x5344)
#define TIM4_PSCR sfrp(0x5345)
#define TIM4_ARR sfrp(0x5346)

/* Timer 4 bitmasks */

#define TIM4_CR1_ARPE (1 << 7)
#define TIM4_CR1_OPM (1 << 3)
#define TIM4_CR1_URS (1 << 2)
#define TIM4_CR1_UDIS (1 << 1)
#define TIM4_CR1_CEN (1 << 0)

#define TIM4_IER_UIE (1 << 0)

#define TIM4_SR_UIF (1 << 0)

#define TIM4_EGR_UG (1 << 0)

#define TIM4_PSCR_PSC2 (1 << 2)
#define TIM4_PSCR_PSC1 (1 << 1)
#define TIM4_PSCR_PSC0 (1 << 0)

#define TIM4_PSCR_1 0
#define TIM4_PSCR_2 1
#define TIM4_PSCR_4 2
#define TIM4_PSCR_8 3
#define TIM4_PSCR_16 4
#define TIM4_PSCR_32 5
#define TIM4_PSCR_64 6
#define TIM4_PSCR_128 7

// ADC2 
#define ADC_CSR sfrp(0x5400)
#define ADC_CR1 sfrp(0x5401)
#define ADC_CR2 sfrp(0x5402)
#define ADC_CR3 sfrp(0x5403)
#define ADC_DRH sfrp(0x5404)
#define ADC_DRL sfrp(0x5405)
#define ADC_TDRH sfrp(0x5406)
#define ADC_TDRL sfrp(0x5407)

/* ADC bitmasks */

#define ADC_CSR_EOC (1 << 7)
#define ADC_CSR_AWD (1 << 6)
#define ADC_CSR_EOCIE (1 << 5)
#define ADC_CSR_AWDIE (1 << 4)
#define ADC_CSR_CH3 (1 << 3)
#define ADC_CSR_CH2 (1 << 2)
#define ADC_CSR_CH1 (1 << 1)
#define ADC_CSR_CH0 (1 << 0)

#define ADC_CR1_SPSEL2 (1 << 6)
#define ADC_CR1_SPSEL1 (1 << 5)
#define ADC_CR1_SPSEL0 (1 << 4)
#define ADC_CR1_CONT (1 << 1)
#define ADC_CR1_ADON (1 << 0)

#define ADC_CR2_EXTTRIG (1 << 6)
#define ADC_CR2_EXTSEL1 (1 << 5)
#define ADC_CR2_EXTSEL0 (1 << 4)
#define ADC_CR2_ALIGN (1 << 3)
#define ADC_CR2_SCAN (1 << 1)

#define ADC_CR3_DBUF (1 << 7)
#define ADC_CR3_DRH (1 << 6)

// beCAN
#define CAN_MCR sfrp(0x5420)
#define CAN_MSR sfrp(0x5421)
#define CAN_TSR sfrp(0x5422)
#define CAN_TPR sfrp(0x5423)
#define CAN_RFR sfrp(0x5424)
#define CAN_IER sfrp(0x5425)
#define CAN_DGR sfrp(0x5426)
#define CAN_FPSR sfrp(0x5427)
#define CAN_P0 sfrp(0x5428)
#define CAN_P1 sfrp(0x5429)
#define CAN_P2 sfrp(0x542A)
#define CAN_P3 sfrp(0x542B)
#define CAN_P4 sfrp(0x542C)
#define CAN_P5 sfrp(0x542D)
#define CAN_P6 sfrp(0x542E)
#define CAN_P7 sfrp(0x542F)
#define CAN_P8 sfrp(0x5430)
#define CAN_P9 sfrp(0x5431)
#define CAN_PA sfrp(0x5432)
#define CAN_PB sfrp(0x5433)
#define CAN_PC sfrp(0x5434)
#define CAN_PD sfrp(0x5435)
#define CAN_PE sfrp(0x5436)
#define CAN_PF sfrp(0x5437)

/* CPU */
#define CPU_A sfrp(0x7F00)
#define CPU_PCE sfrp(0x7F01)
#define CPU_PCH sfrp(0x7F02)
#define CPU_PCL sfrp(0x7F03)
#define CPU_XH sfrp(0x7F04)
#define CPU_XL sfrp(0x7F05)
#define CPU_YH sfrp(0x7F06)
#define CPU_YL sfrp(0x7F07)
#define CPU_SPH sfrp(0x7F08)
#define CPU_SPL  sfrp(0x7F09)
#define CPU_CCR  sfrp(0x7F0A)

// global configuration register
#define CFG_GCR  sfrp(0x7F60)

// interrupt control registers
#define ITC_SPR1  sfrp(0x7F70)
#define ITC_SPR2  sfrp(0x7F71)
#define ITC_SPR3  sfrp(0x7F72)
#define ITC_SPR4  sfrp(0x7F73)
#define ITC_SPR5  sfrp(0x7F74)
#define ITC_SPR6  sfrp(0x7F75)
#define ITC_SPR7  sfrp(0x7F76)
#define ITC_SPR8  sfrp(0x7F77)

/* SWIM, control and status register */
#define SWIM_CSR  sfrp(0x7F80)
/* debug registers */
#define DM_BK1RE  sfrp(0x7F90)
#define DM_BK1RH  sfrp(0x7F91)
#define DM_BK1RL  sfrp(0x7F92)
#define DM_BK2RE  sfrp(0x7F93)
#define DM_BK2RH  sfrp(0x7F94)
#define DM_BK2RL  sfrp(0x7F95)
#define DM_CR1  sfrp(0x7F96)
#define DM_CR2  sfrp(0x7F97)
#define DM_CSR1  sfrp(0x7F98)
#define DM_CSR2  sfrp(0x7F99)
#define DM_ENFCTR  sfrp(0x7F9A)

/* Interrupt Numbers */
#define INT_TLI 0
#define INT_AWU 1
#define INT_CLK 2
#define INT_EXTI0 3
#define INT_EXTI1 4
#define INT_EXTI2 5
#define INT_EXTI3 6
#define INT_EXTI4 7
#define INT_CAN_RX 8
#define INT_CAN_TX 9
#define INT_SPI 10
#define INT_TIM1_OVF 11
#define INT_TIM1_CCM 12
#define INT_TIM2_OVF 13
#define INT_TIM2_CCM 14
#define INT_TIM3_OVF 15
#define INT_TIM3_CCM 16
#define INT_UART1_TX_COMPLETED 17
#define INT_UART1_RX_FULL 18
#define INT_I2C 19
#define INT_UART3_TX_COMPLETED 20
#define INT_UART3_RX_FULL 21
#define INT_ADC1 22
#define INT_TIM4_OVF 23
#define INT_FLASH 24

/* Interrupt Vectors */
#define INT_VECTOR_RESET 0x8000
#define INT_VECTOR_TRAP 0x8004
#define INT_VECTOR_TLI 0x8008
#define INT_VECTOR_AWU 0x800C
#define INT_VECTOR_CLK 0x8010
#define INT_VECTOR_EXTI0 0x8014
#define INT_VECTOR_EXTI1 0x8018
#define INT_VECTOR_EXTI2 0x801C
#define INT_VECTOR_EXTI3 0x8020
#define INT_VECTOR_EXTI4 0x8024
#define INT_VECTOR_CAN_RX 0x8028
#define INT_VECTOR_CAN_TX 0x802c
#define INT_VECTOR_SPI 0x8030
#define INT_VECTOR_TIM1_OVF 0x8034
#define INT_VECTOR_TIM1_CCM 0x8038
#define INT_VECTOR_TIM2_OVF 0x803C
#define INT_VECTOR_TIM2_CCM 0x8040
#define INT_VECTOR_TIM3_OVF 0x8044
#define INT_VECTOR_TIM3_CCM 0x8048
#define INT_VECTOR_UART1_TX_COMPLETED  0x804c
#define INT_VECTOR_UART1_RX_FULL 0x8050
#define INT_VECTOR_I2C 0x8054
#define INT_VECTOR_UART3_TX_COMPLETED 0x8058
#define INT_VECTOR_UART3_RX_FULL 0x805C
#define INT_VECTOR_ADC2 0x8060
#define INT_VECTOR_TIM4_OVF 0x8064
#define INT_VECTOR_FLASH 0x8068

#define nointerrupts() {__asm sim __endasm;}
#define interrupts() {__asm rim __endasm;}
#define wait_for_interrupt() {\
    __asm \
    wfi\
    nop\
    nop\
 __endasm;}

// special function register bits clear/set
#define _clrbit(reg, mask) reg &= ~mask
#define _setbit(reg, mask) reg |= mask
#define _togglebit(reg,mask) reg ^= mask
#define _ledon() PC_ODR|=(1<<5)
#define _ledoff() PC_ODR&=~(1<<5)


#endif //STM8S208_H
